app/controllers/users_controller.rb

  def index
    #@users = User.all
    @users = User.order(:name)
---
SELECT `users`.* FROM `users` ORDER BY `users`.`name` ASC

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`level`, `surname`, `name`, `email`, `password_digest`, `birthday`, `parents`, `photo_url`, `injured`, `injury_archive`, `suspended`, `cards_archive`, `role`, `school`, `school_archive`, `physic_char`, `playtime`, `arriving_date`, `endcontrat_date`, `sportactivity_archive`, `created_at`, `updated_at`) VALUES (1, 'Bernard', 'Moret', 'cadibiss@gmail.com', '$2a$10$wxpkjLRqkGBrr6/i09T.0ucqgW8oglmEBW.uruHiTnCkJtkWgBVF2', '2017-03-04', 'Jean-Claude (0796286991)', '', 1, 'None', 0, 'None', 1, 'Calvin', 'None', 'None', 59, '2017-03-04', '2017-03-04', 'None', '2017-03-04 13:06:53', '2017-03-04 13:06:53')

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE `users` SET `parents` = 'Jean-Noël Moret\r\n0796286991\r\nRue des Bonnes-Luites 61\r\n1920 Martigny', `photo_url` = 'logo.png', `injury_archive` = 'Ligaments croisés (2012)\r\nAducteurs (2011)', `cards_archive` = '03.04.2017 jaune\r\n20.02.2017 jaune\r\n15.12.2016 rouge', `physic_char` = '1m80\r\n80kg', `updated_at` = '2017-03-08 11:20:26' WHERE `users`.`id` = 1

  def destroy
    begin
      @user.destroy
---
DELETE FROM `users` WHERE `users`.`id` = 2